{
  "book": {
    "book_id": "leo-live-book-ai-agents-2026-vn",
    "title": "LEO LIVE BOOK: AI Agents, Tri Thức và Hệ Thống Kích Hoạt (Technical & Business Edition)",
    "image_cover_url": "https://img.icons8.com/plasticine/1200/storytelling.jpg",
    "author": "LEO AI Collective",
    "description": "Tài liệu chuyên sâu về vận hành AI Agents trong LEO CDP. Dành cho Kỹ sư dữ liệu (triển khai kiến trúc USPA, APIs, Data Pipelines) và Nhà quản lý (tối ưu hóa ROI, CLTV và trải nghiệm khách hàng).",
    "version": "2.0.0",
    "language": "vi-VN",
    "repository_url": "https://github.com/trieu/leo-cdp-framework",
    "last_updated": "2026-02-01"
  },
  "chapters": [
    {
      "chapter_id": "ch01",
      "chapter_number": 1,
      "chapter_title": "Giới thiệu: Kỷ nguyên của AI Agents",
      "sections": [
        {
          "section_id": "ch01-sec01",
          "section_number": "1.1",
          "section_title": "LEO CDP là gì? Nền tảng AI-first cho dữ liệu & Activation",
          "keywords": [
            "LEO CDP",
            "AI-first Customer Data Platform",
            "Event-driven Architecture",
            "Identity Graph",
            "Real-time Data Ingestion",
            "Single Customer Graph",
            "AI Agents",
            "Data Activation"
          ],
          "summary": "LEO CDP (Leo Customer Data Platform) là một nền tảng AI-first được thiết kế để hợp nhất, xử lý và làm giàu dữ liệu khách hàng theo thời gian thực, từ đó cung cấp một Golden Customer Profile sống. Trên nền dữ liệu này, AI Agents được kích hoạt để suy luận, ra quyết định và thực thi các hành động cá nhân hóa trên mọi touchpoint.",
          "content": [
            "![leo-cdp-version-2.0](media/leo-cdp-version-2.0.png)",
            "### 1. LEO CDP không phải CDP truyền thống\n\nPhần lớn CDP trên thị trường được xây với mục tiêu **thu thập và báo cáo dữ liệu**. LEO CDP được xây với mục tiêu khác:\n\n> **Biến dữ liệu thành hành động thông minh theo thời gian thực.**\n\nLEO CDP không dừng ở việc tạo Single Customer View tĩnh. Nó tạo ra **Single Customer Graph động**, liên tục được cập nhật bởi sự kiện và được sử dụng trực tiếp bởi AI Agents.",
            "### 2. Mục tiêu cốt lõi của LEO CDP\n\nLEO CDP phục vụ hai mục tiêu song song:\n\n- **Unify & Enrich Data:** Hợp nhất dữ liệu từ mọi nguồn thành một Golden Profile theo thời gian thực\n- **Activate with AI:** Sử dụng AI reasoning để cá nhân hóa trải nghiệm và dẫn dắt hành vi khách hàng\n\nCDP xử lý dữ liệu. **AI Agents sử dụng dữ liệu đó để hành động.**",
            "### 3. Kiến trúc AI-first của LEO CDP\n\nLEO CDP được thiết kế theo kiến trúc **Event-driven + Agent-based**:\n\n**External & Internal Data Sources**\n- Web SDK, Mobile SDK\n- CRM, ERP, Payment, HR, Logistics\n\n**Data Observer (Real-time Ingestion)**\n- Nhận behavioral & transactional events\n- Chuẩn hóa dữ liệu ngay khi phát sinh\n\n**Data Agents (Scheduled & Sync Jobs)**\n- Đồng bộ dữ liệu nội bộ\n- Làm giàu hồ sơ khách hàng theo thời gian\n\n**Data Queue & Processor**\n- Xử lý bất đồng bộ, chịu tải cao\n- Đảm bảo low-latency cho real-time use cases",
            "### 4. Identity Resolution & Customer Graph\n\nKhác với CDP dùng bảng phẳng, LEO CDP sử dụng **Graph Database (ArangoDB)** để mô hình hóa:\n\n- Khách hàng\n- Thiết bị\n- Sự kiện\n- Giao dịch\n- Hành trình\n\n**Entity Resolution** cho phép:\n- Hợp nhất nhiều định danh thành một con người\n- Cập nhật danh tính theo thời gian (progressive identity)\n\nKết quả là một **Golden Customer Graph**, không phải record tĩnh.",
            "### 5. LEO CDP là nền tảng cho AI Agents\n\nLEO CDP không tự gửi email hay push notification.\n\nNó cung cấp **ngữ cảnh, dữ liệu và quyền truy cập** cho AI Agents trong LEO Activation:\n\n- Agents for Data Enrichment (labeling, scoring, segmentation)\n- Agents for Notification & Campaign\n- Personal AI Assistant (Chatbot)\n\nAI Agents sử dụng dữ liệu từ CDP để:\n- Suy luận theo ngữ cảnh\n- Quyết định hành động phù hợp\n- Cá nhân hóa theo từng cá nhân, từng thời điểm",
            "### 6. Real-time Activation & Feedback Loop\n\nLEO CDP hỗ trợ activation với độ trễ thấp:\n\n- Real-time notification (Web Push, App Push)\n- Personalized messaging (Email, Zalo OA, FB Page)\n- Conversational activation (AI Assistant)\n\nMọi phản hồi của khách hàng quay lại hệ thống như **event mới**, ghi nhận vào Customer Graph và tiếp tục nuôi vòng học (learning loop).",
            "### 7. Bảo mật, phân quyền và kiểm soát\n\nLEO CDP tích hợp:\n- OpenID Connect (Keycloak)\n- Phân quyền Admin / Business / System\n- Kiểm soát truy cập dữ liệu theo role\n\nĐiều này cho phép triển khai LEO CDP ở môi trường enterprise với yêu cầu bảo mật cao.",
            "### 8. LEO CDP giải quyết vấn đề gì?\n\n- Phá vỡ data silos giữa các hệ thống\n- Chuyển dữ liệu từ batch sang real-time\n- Cho phép AI Agents hành động an toàn trên dữ liệu thật\n- Cá nhân hóa ở quy mô lớn mà không cần flow cứng\n\nLEO CDP không phải công cụ marketing.\nNó là **hạ tầng dữ liệu & activation cho AI-driven organization**."
          ]
        },
        {
          "section_id": "ch01-sec02",
          "section_number": "1.2",
          "section_title": "AI Agent trong LEO CDP: Từ Khái Niệm đến Activation",
          "summary_video": {
            "title": "AI Agents trong LEO CDP – Kiến trúc Event-driven & Activation Loop",
            "youtube_id": "eHEHE2fpnWQ"
          },
          "keywords": [
            "AI Agent",
            "LEO Activation",
            "Customer Data Platform",
            "Event-driven Architecture",
            "Agent Orchestration",
            "ArangoDB",
            "PostgreSQL 16",
            "Personalization",
            "Data Activation"
          ],
          "summary": "Trong LEO CDP, AI Agent không phải là chatbot trả lời câu hỏi, mà là một tác nhân kích hoạt (Activation Agent) vận hành trên dữ liệu khách hàng, sự kiện hành vi và mục tiêu kinh doanh. Agent quan sát dữ liệu, suy luận theo ngữ cảnh, điều phối công cụ và chủ động hành động để thay đổi nhận thức, ý định và hành vi của khách hàng theo thời gian thực.",
          "content": [
            "![leo-cdp-agent-architecture](https://raw.githubusercontent.com/trieu/leo-activation/main/leo-activation-framework.png)",
            "### 1. AI Agent trong LEO CDP không phải Chatbot\n\nPhần lớn hệ thống GenAI hiện nay dừng lại ở **Conversational AI** – trả lời khi người dùng hỏi. LEO CDP đi xa hơn: **AI Agent là một thành phần vận hành trong hệ thống dữ liệu và kích hoạt (Activation System)**.\n\nTrong kiến trúc LEO CDP:\n- LLM chỉ là **Reasoning Engine**\n- AI Agent là **thực thể có trạng thái, mục tiêu và quyền hành động**\n- Chatbot chỉ là *một giao diện* của Agent, không phải bản chất của nó\n\nAgent không chờ câu hỏi. Agent phản ứng với **event**: hành vi web, giao dịch, thay đổi hồ sơ, hoặc tín hiệu từ hệ thống khác.",
            "### 2. Kiến Trúc AI Agent trong LEO CDP (Mapping trực tiếp từ sơ đồ)\n\n**A. Data Layer – Nền tảng nhận thức**\n\n- **ArangoDB (LEO CDP Core):** Lưu các collection như `cdp_profile`, `cdp_journeymap`, `cdp_segment`, `cdp_campaign`, `cdp_agent`.\n- **External Profile Data:** Dữ liệu đồng bộ từ PostgreSQL, CSV, Google Sheets, CRM, ERP.\n- **PostgreSQL 16+:** Lớp dữ liệu chuẩn hóa cho segmentation, recommendation, activation history.\n\nAgent không \"nhớ\" bằng prompt – Agent truy xuất dữ liệu thật.\n\n**B. Event Layer – Giác quan của Agent**\n\n- Behavioral Events (click, view, scroll)\n- Transactional Events (order, payment, refund)\n- System Events (sync xong dữ liệu, campaign kết thúc)\n\nMỗi event là một **signal** kích hoạt vòng suy luận của Agent.\n\n**C. Agent Orchestration Layer**\n\n- FastAPI + Agent Router\n- Phân loại agent: Notification Agent, Enrichment Agent, Assistant Agent\n- Điều phối multi-agent theo ngữ cảnh (không phải 1 agent làm tất cả)\n\n**D. Tool & Action Layer**\n\n- Gửi Email, Zalo OA, FB Page\n- Web Push / App Push real-time\n- Chạy segmentation, labeling, recommendation\n- Ghi log, cập nhật profile, chuyển trạng thái journey\n\nĐây là nơi **AI chuyển từ suy nghĩ sang hành động**.",
            "### 3. Activation Loop: AI Agent thực sự vận hành như thế nào?\n\nLEO CDP triển khai Agent theo vòng lặp Activation (mở rộng OODA):\n\n1. **Observe:** Nhận event từ touchpoint (web/app/backend)\n2. **Contextualize:** Truy xuất profile, journey stage, lịch sử activation\n3. **Reason:** LLM + system prompt + rule + goal\n4. **Decide:** Chọn *có kích hoạt hay không*, kích hoạt cái gì, qua kênh nào\n5. **Act:** Thực thi hành động (notification, assistant, update data)\n6. **Learn:** Ghi nhận phản hồi để điều chỉnh hành vi Agent\n\nKhông có bước nào là \"random\". Mọi activation đều có lý do và trace được.",
            "### 4. Các Loại AI Agent trong LEO Activation\n\n**Notification Agent**\n- Kết hợp segment + campaign + template\n- Quyết định *thời điểm*, *kênh*, *nội dung*\n- Tránh spam, tránh trùng lặp\n\n**Data Enrichment Agent**\n- Gắn nhãn hành vi (intent, interest)\n- Tự động cập nhật segment\n- Đề xuất sản phẩm hoặc next-best-action\n\n**Personal AI Assistant**\n- Giao tiếp 1-1 (Chatbot, Telegram, WhatsApp)\n- Dựa trên profile + journey hiện tại\n- Không trả lời chung chung, mà theo lịch sử cá nhân\n\nCác Agent này **phối hợp**, không hoạt động độc lập.",
            "### 5. Use Cases Thực Tế\n\n**Use case 1 – E-commerce:**\nKhách hàng xem sản phẩm 3 lần nhưng chưa mua → Behavioral Event → Agent phát hiện do dự → Gửi push cá nhân hóa + ưu đãi phù hợp → Tăng conversion.\n\n**Use case 2 – SaaS / B2B:**\nUser dùng trial, không active tính năng chính → Agent phân tích usage → Assistant chủ động hướng dẫn → Email follow-up theo hành vi → Giảm churn.\n\n**Use case 3 – Giáo dục / EdTech:**\nHọc viên dừng ở một module → Agent nhận signal → Gửi nội dung bổ trợ + giải thích \"vì sao nên học tiếp\" → Thay đổi nhận thức, không chỉ nhắc nhở.\n\nĐiểm chung: **Agent không bán hàng, Agent dẫn dắt hành vi**.",
            "### 6. LEO CDP khác gì hệ thống Marketing Automation truyền thống?\n\n- Không chạy flow cứng → chạy theo event và ngữ cảnh\n- Không cá nhân hóa bằng rule → cá nhân hóa bằng reasoning\n- Không tối ưu click → tối ưu hành vi dài hạn\n\nLEO CDP coi khách hàng là **con người có hành trình học và thay đổi**, không phải record trong database.",
            "### 7. Tương Lai: Multi-Agent & Self-Improving CDP\n\nLEO Activation hướng tới hệ CDP mà:\n- Agent tự đánh giá hiệu quả của mình\n- Agent học từ phản hồi (implicit & explicit)\n- Agent điều chỉnh chiến lược activation theo thời gian\n\nĐây không còn là \"công cụ marketing\".\nĐây là **hệ thống dẫn dắt hành vi ở quy mô lớn**."
          ]
        },
        {
          "section_id": "ch01-sec03",
          "section_number": "1.3",
          "section_title": "Từ Dữ liệu thô đến Trải nghiệm số: Hành trình của Data",
          "keywords": [
            "Data Pipeline",
            "Real-time Ingestion",
            "Identity Resolution",
            "Single Customer View",
            "Hyper-personalization",
            "Low-latency Activation",
            "Data Silos"
          ],
          "summary": "Phân tích toàn diện quy trình biến đổi dữ liệu thô (Raw Data) thành hành động tiếp thị có ý nghĩa. Chương này đi sâu vào kiến trúc kỹ thuật của Data Pipeline, tầm quan trọng của việc xử lý thời gian thực (Real-time), và cách hợp nhất dữ liệu đa kênh để tạo ra trải nghiệm khách hàng siêu cá nhân hóa.",
          "content": [
            "![uspa_framework_data_driven](media/uspa_framework_data_driven.png)",
            "### 1. Bản Chất Của Vấn Đề: Dữ Liệu Thô Là 'Dầu Thô'\n\nTrong kỷ nguyên số, chúng ta thường nghe câu nói 'Dữ liệu là dầu mỏ mới'. Tuy nhiên, phép ẩn dụ này cần được hiểu chính xác: Dữ liệu thô (Raw Data) giống như dầu thô mới khai thác—nó hỗn độn, bẩn, và chưa thể sử dụng để chạy động cơ. Nếu đổ trực tiếp dầu thô vào xe hơi, động cơ sẽ hỏng. Tương tự, nếu đẩy trực tiếp log server hay clickstream chưa qua xử lý vào hệ thống Marketing, doanh nghiệp sẽ tạo ra những trải nghiệm khách hàng rời rạc và sai lệch.\n\nHành trình 'Từ Dữ liệu thô đến Trải nghiệm số' là quá trình tinh lọc, làm giàu và kích hoạt. Mục tiêu không phải là thu thập nhiều dữ liệu nhất, mà là rút ngắn tối đa thời gian từ lúc dữ liệu xuất hiện (Data Creation) đến lúc nó tạo ra giá trị (Value Creation).",
            "### 2. Kiến Trúc Kỹ Thuật: Giải Phẫu Một Data Pipeline Hiện Đại\n\nĐể biến đổi hàng tỷ điểm dữ liệu thành một trải nghiệm mượt mà, hệ thống cần trải qua 4 giai đoạn kỹ thuật cốt lõi:\n\n**Giai đoạn 1: Ingestion (Thu nạp - The Input Stream)**\nĐây là cửa ngõ đầu tiên. Dữ liệu đến từ vô số nguồn: Mobile App (SDK), Website (JavaScript Tags), CRM (Backend API), IoT Devices, và cả POS tại cửa hàng vật lý.\n- *Thách thức:* Dữ liệu không đồng nhất. Một khách hàng có thể được định danh là `user_id: 123` trên web, nhưng là `email: abc@gmail.com` trên CRM.\n- *Công nghệ:* Sử dụng các message broker hiệu năng cao như **Apache Kafka** hoặc **Google Pub/Sub** để hứng luồng dữ liệu khổng lồ với độ trễ mili giây.\n\n**Giai đoạn 2: Processing & Transformation (Xử lý & Chuyển đổi)**\nTại đây, dữ liệu được làm sạch (Cleaning). Các giá trị null bị loại bỏ, định dạng ngày tháng được chuẩn hóa (Normalization). Quan trọng hơn, hệ thống thực hiện **Identity Resolution** (Hợp nhất định danh). \n- *Cơ chế:* Hệ thống so khớp mờ (Fuzzy matching) hoặc chính xác (Deterministic matching) để nhận ra rằng người đang lướt web ẩn danh và người vừa mở email tuần trước là cùng một người. Kết quả là tạo ra một **Unified Customer Profile** (Hồ sơ khách hàng hợp nhất).\n\n**Giai đoạn 3: Enrichment (Làm giàu dữ liệu)**\nDữ liệu hành vi (Behavioral Data) được kết hợp với dữ liệu ngữ cảnh (Contextual Data). \n- *Ví dụ:* Khi biết khách hàng đang xem 'áo mưa', hệ thống kết hợp với dữ liệu thời tiết API (đang mưa to tại vị trí khách hàng) để tăng trọng số cho việc đề xuất sản phẩm. Đây là bước biến 'Data' thành 'Insight'.",
            "### 3. Yếu Tố Thời Gian: Latency Is The Killer\n\nTrong môi trường kinh doanh hiện đại, giá trị của dữ liệu tỷ lệ nghịch với thời gian tồn tại của nó. \n\n- **Batch Processing (Xử lý theo lô):** Cách làm cũ là thu thập dữ liệu cả ngày và xử lý vào ban đêm. Điều này giống như việc bạn đọc tin tức ngày hôm qua. Nếu khách hàng bỏ giỏ hàng lúc 9 giờ sáng, nhưng đến 9 giờ sáng hôm sau hệ thống mới gửi email nhắc nhở, cảm xúc mua hàng (Buying Impulse) đã nguội lạnh.\n- **Real-time Processing (Xử lý thời gian thực):** Các hệ thống hiện đại như LEO CDP hướng tới **Low-latency ingestion**. Thời gian từ lúc người dùng 'Click' đến lúc hệ thống sẵn sàng phản hồi phải dưới **200ms**. Tại sao? Vì đó là giới hạn nhận thức của não bộ con người về sự 'tức thì'. Phản hồi chậm hơn ngưỡng này sẽ khiến trải nghiệm số trở nên rời rạc và kém thông minh.",
            "### 4. Vai Trò Chiến Lược Của LEO CDP: Phá Vỡ Data Silos\n\nTrước khi có Customer Data Platform (CDP), dữ liệu bị nhốt trong các 'Silos' (tháp kín):\n- Đội Sales dùng CRM.\n- Đội Marketing dùng Email Tool.\n- Đội Tech quản lý Database.\n\nKhông ai nhìn thấy bức tranh toàn cảnh. LEO CDP đóng vai trò là **'Single Source of Truth' (Nguồn sự thật duy nhất)**. Nó không thay thế các công cụ trên, mà là lớp kết nối trung gian. \n\n**Cơ chế Activation (Kích hoạt):**\nSau khi dữ liệu được xử lý, CDP không giữ nó lại mà đẩy ngược ra (Reverse ETL) các kênh tương tác:\n- Đẩy segment khách hàng VIP vào Facebook Ads để tối ưu chi phí quảng cáo.\n- Kích hoạt Zalo Message ngay khi khách hàng vừa thanh toán thành công.\n- Thay đổi banner trang chủ website dựa trên sở thích người dùng vừa tìm kiếm 5 giây trước.",
            "### 5. Từ Góc Nhìn Kinh Doanh: ROI và Time-to-Market\n\nViệc đầu tư vào hạ tầng dữ liệu không chỉ là câu chuyện của IT, mà là vũ khí cạnh tranh của CEO và CMO.\n\n- **Tăng Conversion Rate (Tỷ lệ chuyển đổi):** Thống kê cho thấy các chiến dịch được kích hoạt dựa trên hành vi thời gian thực (Event-triggered) có tỷ lệ mở và chuyển đổi cao gấp **3-5 lần** so với các chiến dịch gửi đại trà (Blast campaigns).\n- **Giảm Churn Rate (Tỷ lệ rời bỏ):** Nhờ phát hiện sớm các tín hiệu không hài lòng (ví dụ: khách hàng truy cập trang 'Hủy dịch vụ' hoặc feedback tiêu cực), hệ thống có thể tự động tạo ticket cho CSKH chăm sóc ngay lập tức, thay vì đợi đến cuối tháng báo cáo.\n- **Tối ưu hóa ngân sách (Budget Optimization):** Bằng cách loại trừ (Exclude) những người vừa mới mua hàng ra khỏi danh sách quảng cáo, doanh nghiệp tiết kiệm được hàng ngàn đô la chi phí hiển thị lãng phí.\n\n### 6. Kết Luận\n\nHành trình từ 'Dữ liệu thô' đến 'Trải nghiệm số' là sự kết hợp giữa nghệ thuật thấu hiểu khách hàng và khoa học dữ liệu chính xác. Doanh nghiệp làm chủ được dòng chảy dữ liệu (Data Flow) sẽ làm chủ được thị trường. Không phải ai có nhiều dữ liệu nhất sẽ thắng, mà là ai xử lý và kích hoạt dữ liệu nhanh nhất sẽ dẫn đầu."
          ]
        }
      ]
    },
    {
      "chapter_id": "ch02",
      "chapter_number": 2,
      "chapter_title": "Các trường hợp sử dụng (Use Cases)",
      "sections": [
        {
          "section_id": "ch02-sec01",
          "section_number": "2.1",
          "section_title": "Bán lẻ Đa Kênh trong LEO CDP: Hợp nhất Danh tính, Ngữ cảnh và Hành vi",
          "keywords": [
            "Omnichannel Retail",
            "O2O Mapping",
            "Identity Graph",
            "ArangoDB",
            "POS Integration",
            "Event-driven Activation",
            "RFM Analysis",
            "Customer Lifetime Value"
          ],
          "summary": "Trong LEO CDP, Omnichannel không chỉ là kết nối các kênh bán hàng, mà là hợp nhất danh tính con người, dòng sự kiện và hành vi mua sắm thành một Customer Graph duy nhất. Mục tiêu không phải báo cáo, mà là kích hoạt AI Agents để cá nhân hóa trải nghiệm và tối ưu giá trị vòng đời khách hàng (CLV) theo thời gian thực.",
          "content": [
            "![leo_cdp_o2o_retail](media/leo_cdp_o2o_retail.png)",
            "### 1. Vấn đề cốt lõi của Omnichannel Retail\n\nBán lẻ đa kênh thất bại không phải vì thiếu dữ liệu, mà vì **dữ liệu không nói cùng một ngôn ngữ**.\n\n- POS biết giao dịch, nhưng không biết hành vi trước đó\n- Website biết hành vi, nhưng không biết ai vừa thanh toán offline\n- CRM có hồ sơ, nhưng không biết khách đang đứng ở đâu trong hành trình\n\nCâu hỏi trọng tâm không phải là *\"bán ở đâu\"*, mà là:\n> **Đây có phải là cùng một con người, trong cùng một hành trình hay không?**",
            "### 2. Identity Graph – Nền tảng Omnichannel của LEO CDP\n\nLEO CDP không dùng bảng phẳng để quản lý khách hàng. Hệ thống sử dụng **Identity Graph trên ArangoDB** để mô hình hóa mối quan hệ:\n\n- `Profile` ↔ `Device` ↔ `Session`\n- `Profile` ↔ `Transaction` (Online / Offline)\n- `Profile` ↔ `Location` ↔ `Store`\n\nMỗi sự kiện (event) không chỉ ghi log, mà được **gắn vào đồ thị danh tính**, cho phép hệ thống trả lời các câu hỏi ngữ cảnh theo thời gian thực.",
            "### 3. Identity Resolution trong LEO CDP hoạt động thế nào?\n\nLEO CDP triển khai **Identity Resolution đa tầng**:\n\n1. **Deterministic Matching**\n   - SĐT, Email, Loyalty ID, QR Code\n   - Áp dụng khi có độ tin cậy tuyệt đối\n\n2. **Probabilistic Matching**\n   - Device Fingerprint, IP, Location, Time Window\n   - Gán trọng số và độ tin cậy (confidence score)\n\n3. **Progressive Identity Building**\n   - Hồ sơ không hoàn thiện vẫn được kích hoạt\n   - Danh tính được làm giàu dần theo hành vi\n\nKết quả không phải một record tĩnh, mà là **Golden Profile sống**, luôn cập nhật.",
            "### 4. POS & Offline Events: Offline không còn là \"vùng mù\"\n\n**POS Integration trong LEO CDP** không dừng ở batch cuối ngày:\n\n- Hóa đơn in ra → Webhook → Event Stream\n- Event được gắn vào Profile hiện tại trong Identity Graph\n- Kích hoạt ngay AI Agent nếu thỏa điều kiện\n\nOffline trở thành **một touchpoint bình thường**, giống Web hay App.\n\nNếu khách trả tiền mặt và chưa xác định danh tính, hệ thống vẫn lưu event và **chờ future identity resolution**.",
            "### 5. AI Agents kích hoạt Omnichannel Experience như thế nào?\n\nTrong LEO Activation, Omnichannel được vận hành bởi các Agent chuyên biệt:\n\n**Customer Context Agent**\n- Tổng hợp lịch sử Online + Offline\n- Xác định journey stage hiện tại\n\n**Retail Activation Agent**\n- Quyết định có kích hoạt hay không\n- Chọn kênh: Zalo OA, App Push, Email, Sales Tablet\n\n**Store-facing Agent (Clienteling)**\n- Đẩy insight cho nhân viên bán hàng\n- Không hiển thị raw data, chỉ hiển thị *\"nên làm gì\"*\n\nAgent không chạy theo rule cứng, mà theo **ngữ cảnh và mục tiêu kinh doanh**.",
            "### 6. Kịch bản Omnichannel thực chiến\n\n**Kịch bản 1 – Online → Offline Conversion**\n- Khách xem sản phẩm online nhiều lần\n- Chưa mua → có dấu hiệu quan tâm cao\n- Khi khách vào cửa hàng gần nhất → Agent gửi ưu đãi đúng sản phẩm, đúng cửa hàng\n\n**Kịch bản 2 – Offline → Online Retention**\n- Khách mua tại cửa hàng\n- 3 ngày sau không quay lại\n- Agent gửi nội dung hướng dẫn sử dụng + gợi ý mua kèm online\n\n**Kịch bản 3 – VIP Clienteling**\n- Khách CLV cao bước vào cửa hàng\n- Nhân viên nhận insight: sản phẩm yêu thích, size, lịch sử đổi trả\n- Tư vấn cá nhân hóa, không hỏi lại từ đầu",
            "### 7. Đo lường đúng cho Omnichannel\n\nLEO CDP không đo từng kênh riêng lẻ, mà đo theo **con người và hành trình**:\n\n- **O2O Conversion Rate:** Tỷ lệ chuyển đổi giữa các touchpoint\n- **CLV (Customer Lifetime Value):** Theo profile hợp nhất, không theo kênh\n- **RFM Omnichannel:** Recency/Frequency/Monetary trên toàn bộ hệ sinh thái\n- **Activation Effectiveness:** Hành động nào thực sự thay đổi hành vi\n\nĐiều quan trọng nhất: đo **ảnh hưởng dài hạn**, không chỉ doanh thu tức thời.",
            "### 8. Khác biệt của LEO CDP so với Omnichannel truyền thống\n\n- Không ghép dữ liệu → xây Identity Graph\n- Không chạy flow cứng → Agent quyết định theo ngữ cảnh\n- Không tối ưu kênh → tối ưu hành vi con người\n\nOmnichannel trong LEO CDP không phải là chiến thuật bán lẻ.\nĐó là **hệ thống hiểu và dẫn dắt hành vi khách hàng ở mọi điểm chạm**."
          ]
        },
        {
          "section_id": "ch02-sec02",
          "section_number": "2.2",
          "section_title": "Tài chính & Ngân hàng (BFSI) trong LEO CDP: Bảo mật theo Ngữ cảnh, Cá nhân hóa theo Hành vi",
          "keywords": [
            "BFSI CDP",
            "Real-time Fraud Detection",
            "Next Best Action",
            "Behavioral Credit Scoring",
            "Event-driven Architecture",
            "AI Agents",
            "Data Governance",
            "Consent Management",
            "eKYC"
          ],
          "summary": "LEO CDP cho ngành Tài chính – Ngân hàng không tập trung vào marketing đơn thuần, mà vào việc vận hành AI Agents trên dữ liệu hành vi theo thời gian thực. Hệ thống cho phép phát hiện rủi ro tức thì, cá nhân hóa hành động phù hợp và tuân thủ chặt chẽ các quy định về bảo mật, consent và data governance.",
          "content": [
            "### 1. Bối cảnh ngành BFSI: Dữ liệu nhiều nhưng không thể dùng tùy ý\n\nNgân hàng và tổ chức tài chính sở hữu dữ liệu có giá trị cao nhất, nhưng cũng bị ràng buộc nghiêm ngặt nhất:\n- Dữ liệu giao dịch nhạy cảm\n- Quy định pháp lý chặt chẽ (GDPR, Nghị định 13, PCI-DSS)\n- Hệ thống legacy phân mảnh\n\nThách thức không phải là *thiếu dữ liệu*, mà là:\n> **Làm sao kích hoạt dữ liệu đúng lúc, đúng ngữ cảnh, đúng quyền?**",
            "### 2. Kiến trúc LEO CDP cho BFSI\n\nLEO CDP áp dụng kiến trúc **Event-driven + Agent-based**, thay vì batch reporting:\n\n- Mọi giao dịch, đăng nhập, thay đổi hành vi đều là event\n- Event được gắn vào Customer Graph (Identity + Financial Context)\n- AI Agents quyết định hành động, không phải rule cứng\n\nĐiều này cho phép hệ thống vừa **nhanh**, vừa **kiểm soát được rủi ro**.",
            "### 3. Real-time Fraud Detection bằng AI Agent\n\n**Fraud Detection trong LEO CDP không phải là một dashboard**, mà là một Agent luôn chạy.\n\nLuồng hoạt động:\n1. Transaction Event phát sinh\n2. Fraud Context Agent phân tích:\n   - Vị trí\n   - Thiết bị\n   - Thời gian\n   - Hành vi lịch sử\n3. Gán Risk Score theo ngữ cảnh\n4. Kích hoạt hành động phù hợp:\n   - Cảnh báo\n   - Yêu cầu xác thực bổ sung\n   - Tạm hoãn giao dịch\n\nKhông phải mọi rủi ro đều chặn – **Agent chọn phản ứng tương xứng**.",
            "### 4. Behavioral Credit Scoring & Risk Profiling\n\nThay vì chỉ dựa vào hồ sơ tài chính tĩnh, LEO CDP cho phép:\n\n- Chấm điểm tín dụng dựa trên hành vi thực tế\n- Phân tích thói quen thanh toán, dòng tiền, tương tác\n- Cập nhật Risk Profile theo thời gian\n\nVí dụ:\n- Khách không có lịch sử tín dụng mạnh\n- Nhưng có hành vi thanh toán đều đặn, chi tiêu ổn định\n\n→ Agent có thể đề xuất hạn mức phù hợp mà không cần hồ sơ truyền thống.",
            "### 5. Next Best Action (NBA) trong BFSI\n\nTrong LEO CDP, **NBA không phải là bán thêm bằng mọi giá**.\n\nAI Agent đánh giá:\n- Trạng thái tài chính hiện tại\n- Sự kiện vừa xảy ra\n- Mức độ nhạy cảm của thời điểm\n\nVí dụ:\n- Khách vừa tất toán khoản vay → đề xuất bảo hiểm hoặc thẻ phù hợp\n- Khách đang căng dòng tiền → không chào bán, chỉ hỗ trợ\n\nNBA trong BFSI = **đúng hành động, không phải nhiều hành động**.",
            "### 6. Real-time Personalization nhưng không xâm phạm\n\nLEO CDP cho phép cá nhân hóa ở cấp độ:\n- Nội dung cảnh báo\n- Thời điểm gửi\n- Kênh giao tiếp\n\nNhưng **không vi phạm quyền riêng tư**, vì:\n- Agent chỉ dùng dữ liệu đã được consent\n- Mọi hành động đều có audit trail\n- Không lộ dữ liệu nhạy cảm cho front-end",
            "### 7. Consent & Data Governance là phần của hệ thống, không phải phụ kiện\n\nLEO CDP tích hợp sẵn:\n\n- **Consent Management Platform (CMP)**\n- Gắn consent vào từng loại dữ liệu\n- Kiểm tra quyền trước mỗi activation\n\nNếu khách rút consent:\n- Agent tự động dừng sử dụng dữ liệu liên quan\n- Không cần sửa code hoặc rule thủ công",
            "### 8. Business Outcomes cho BFSI\n\nLEO CDP giúp ngân hàng đạt được:\n\n- Giảm fraud loss nhờ phản ứng sớm\n- Tăng cross-sell nhưng không gây phản cảm\n- Giữ chân khách hàng bằng trải nghiệm an toàn\n- Tuân thủ pháp lý ngay từ kiến trúc\n\nQuan trọng nhất: **niềm tin của khách hàng được bảo toàn**.",
            "### 9. BFSI không cần CDP để bán nhiều hơn\n\nNgành tài chính cần CDP để:\n- Ra quyết định tốt hơn\n- Phản ứng nhanh hơn\n- Hành xử có trách nhiệm hơn với dữ liệu\n\nLEO CDP không biến ngân hàng thành công ty quảng cáo.\nNó biến ngân hàng thành **hệ thống hiểu khách hàng theo ngữ cảnh và hành vi thực**."
          ]
        },
        {
          "section_id": "ch02-sec03",
          "section_number": "2.3",
          "section_title": "Media & Marketing Agency trong LEO CDP: Vận hành Audience & Creative trong kỷ nguyên Cookieless",
          "keywords": [
            "Cookieless Marketing",
            "First-party Data",
            "Private Audience Graph",
            "Server-side Tracking",
            "Conversion API",
            "AI Agents",
            "Dynamic Creative Optimization",
            "ROAS Optimization",
            "Media Activation"
          ],
          "summary": "Trong bối cảnh cookieless, Media và Agency không còn cạnh tranh bằng kỹ thuật tracking, mà bằng khả năng sở hữu, hiểu và kích hoạt dữ liệu bên thứ nhất. LEO CDP cung cấp nền tảng Private Audience Graph và AI Agents giúp Agency vận hành audience, creative và media activation theo thời gian thực, giảm phụ thuộc vào Big Tech và tối ưu ROAS một cách bền vững.",
          "content": [
            "![leo_cdp_media_agency](media/leo_cdp_media_agency.png)",
            "### 1. Cookieless không phải là vấn đề kỹ thuật, mà là vấn đề mô hình\n\nSự biến mất của third-party cookies chỉ phơi bày một thực tế:\n\n- Agency không sở hữu dữ liệu khách hàng\n- Audience nằm trong nền tảng quảng cáo, không nằm trong hệ thống của Client\n- Media buying tách rời khỏi hiểu biết về hành vi thực\n\nCookieless buộc Agency phải trả lời câu hỏi:\n> **Chúng ta đang tối ưu media, hay đang xây tài sản dữ liệu cho Client?**",
            "### 2. LEO CDP & Private Audience Graph cho Agency\n\nLEO CDP cho phép Agency xây dựng **Private Audience Graph** cho từng Client:\n\n- Hợp nhất hành vi web, app, CRM, offline\n- Gắn audience với identity thật, không phải cookie tạm thời\n- Phân đoạn dựa trên hành vi, giá trị và ngữ cảnh\n\nAudience không còn là file upload, mà là **tài sản sống**, luôn được cập nhật.",
            "### 3. Server-side Tracking là nền tảng, không phải lợi thế\n\nLEO CDP triển khai **Server-to-Server Tracking** như một tiêu chuẩn mặc định:\n\n- Facebook Conversion API\n- Google Enhanced Conversions\n- TikTok Events API\n\nMọi event đều:\n- Đi từ hệ thống của Client\n- Được chuẩn hóa trước khi gửi đi\n- Gắn với profile trong CDP\n\nTracking không còn phụ thuộc vào trình duyệt hay cookie.",
            "### 4. AI Agents vận hành Media Activation\n\nTrong LEO Activation, Media không chạy bằng rule cứng:\n\n**Audience Agent**\n- Tạo và cập nhật segment theo thời gian thực\n- Tự động loại trừ khách đã chuyển đổi\n\n**Creative Intelligence Agent**\n- Phân tích creative performance theo audience\n- Đề xuất thông điệp phù hợp từng nhóm\n\n**Media Optimization Agent**\n- Điều chỉnh ngân sách và tần suất dựa trên hiệu quả thực\n- Giảm spend vào traffic kém chất lượng\n\nAgency không “set campaign” – Agency **điều phối hệ thống**.",
            "### 5. Dynamic Creative Optimization (DCO) theo ngữ cảnh thật\n\nKhác với DCO truyền thống dựa trên rule:\n\n- LEO CDP dùng hành vi + lịch sử tương tác\n- AI Agent quyết định creative nào nên hiển thị\n\nVí dụ:\n- Người dùng đọc nhiều bài review → creative thiên về so sánh\n- Người quay lại nhiều lần → creative tập trung vào ưu đãi\n\nCreative không chỉ cá nhân hóa – **creative học từ phản hồi**.",
            "### 6. Lookalike Modeling chất lượng cao trong Cookieless Era\n\nLEO CDP không dùng lookalike đại trà:\n\n- Seed audience là nhóm **High-Intent / High-Value**\n- Seed được làm sạch và cập nhật liên tục\n- Kết hợp nhiều chiều hành vi, không chỉ conversion\n\nKết quả:\n- Lookalike nhỏ hơn\n- Nhưng chất lượng cao hơn\n- CPA ổn định hơn theo thời gian",
            "### 7. Audience Suppression & Budget Protection\n\nMột trong những lãng phí lớn nhất của media là:\n- Quảng cáo cho người đã mua\n- Re-target sai thời điểm\n\nLEO CDP cho phép:\n- Suppress audience theo thời gian thực\n- Đồng bộ trạng thái chuyển đổi ngay khi event xảy ra\n\nBudget không bị đốt – **media được bảo vệ bằng dữ liệu**.",
            "### 8. Vai trò mới của Agency trong kỷ nguyên AI\n\nAgency không còn chỉ là:\n- Media buyer\n- Creative producer\n\nAgency trở thành:\n- Kiến trúc sư dữ liệu\n- Người vận hành AI Agents\n- Đối tác xây tài sản dữ liệu cho Client\n\nLEO CDP giúp Agency:\n- Giữ quyền sở hữu dữ liệu cho Client\n- Giảm phụ thuộc vào nền tảng quảng cáo\n- Chuyển từ tối ưu ngắn hạn sang hiệu quả dài hạn",
            "### 9. Kết quả kinh doanh bền vững\n\nVới LEO CDP, Media & Agency đạt được:\n\n- ROAS ổn định, ít biến động\n- CPM & CPA giảm nhờ audience chính xác\n- Creative performance được cải thiện liên tục\n- Client sở hữu dữ liệu, không bị lock-in\n\nCookieless không giết Agency.\nNó buộc Agency **tiến hóa**."
          ]
        },
        {
          "section_id": "ch02-sec04",
          "section_number": "2.4",
          "section_title": "Du lịch & Khách sạn (Travel & Hospitality): Trải nghiệm không điểm dừng",
          "keywords": [
            "Dynamic Pricing",
            "Ancillary Revenue",
            "Pre-trip/Post-trip Engagement",
            "Loyalty Program",
            "Sentiment Analysis"
          ],
          "summary": "Cá nhân hóa hành trình từ lúc tìm kiếm (Dreaming) đến sau chuyến đi (Sharing). Tech: Tích hợp Booking Engine và App. Business: Tăng doanh thu phụ trợ (Ancillary) và lòng trung thành.",
          "content": [
            "### Bối cảnh & Thách thức\nNgành du lịch có 'cửa sổ mua hàng' dài và phức tạp. Khách hàng thường tra cứu giá nhiều lần trước khi đặt. Thách thức là làm sao bắt được đúng 'điểm rơi' cảm xúc để chốt sale và bán thêm dịch vụ.",
            "### Technical Implementation\n1. **Search History Activation:** Ghi nhận điểm đến và ngày dự kiến mà khách hàng tìm kiếm nhưng chưa đặt. Sử dụng dữ liệu này để gửi email nhắc nhở giá vé đang giảm hoặc phòng sắp hết.\n2. **Contextual Push Notification:** Khi App phát hiện khách hàng đã đến sân bay (qua Geo-fencing), hệ thống tự động gửi thông tin hướng dẫn nhận phòng (Check-in) hoặc đề xuất dịch vụ đưa đón.",
            "### Business Scenarios\n- **Up-selling & Cross-selling:** 3 ngày trước chuyến đi, gửi email mời nâng hạng phòng (Upgrade) với giá ưu đãi hoặc mua thêm suất ăn/SPA. Đây là nguồn doanh thu phụ trợ (Ancillary Revenue) khổng lồ.\n- **Real-time Service Recovery:** Nếu khách hàng đánh giá 1 sao trên App về dịch vụ phòng, hệ thống gửi cảnh báo ngay lập tức cho Quản lý khách sạn (Duty Manager) để xử lý và xin lỗi khách ngay khi họ còn đang lưu trú, thay vì để khách về nhà rồi mới viết review xấu trên TripAdvisor.",
            "### Key Metric\n- **RevPAR (Revenue Per Available Room):** Doanh thu trên phòng có sẵn.\n- **Repeat Rate:** Tỷ lệ khách quay lại đặt dịch vụ."
          ]
        },
        {
          "section_id": "ch02-sec05",
          "section_number": "2.5",
          "section_title": "Giáo dục (EdTech & Education): Nuôi dưỡng trọn đời",
          "keywords": [
            "Student Lifecycle Management",
            "Lead Nurturing",
            "Learning Analytics",
            "Retention Rate",
            "Alumni Engagement"
          ],
          "summary": "Chuyển đổi từ tuyển sinh ngắn hạn sang quản lý vòng đời học viên dài hạn. Tech: Tích hợp LMS và CRM. Business: Giảm chi phí tuyển sinh (CPA) và tăng tỷ lệ hoàn thành khóa học.",
          "content": [
            "### Bối cảnh & Thách thức\nQuy trình ra quyết định trong giáo dục thường kéo dài (đặc biệt là các khóa học giá trị cao hoặc du học). Sau khi đăng ký, thách thức là giữ chân học viên (Retention) và khuyến khích họ học tiếp các khóa nâng cao.",
            "### Technical Implementation\n1. **Lead Scoring (Chấm điểm tiềm năng):** Dựa trên hành vi (xem trang học phí, tải brochure, tham gia webinar), hệ thống chấm điểm mức độ quan tâm của phụ huynh/học viên. Sale chỉ gọi những Lead có điểm số cao (Hot Leads).\n2. **LMS Integration (Tích hợp hệ thống học tập):** Đồng bộ dữ liệu tiến độ học tập. Nếu học viên không đăng nhập trong 7 ngày, trigger một email động viên hoặc SMS nhắc nhở tự động.",
            "### Business Scenarios\n- **Personalized Learning Path (Lộ trình cá nhân hóa):** Sau khi học viên hoàn thành khóa 'Tiếng Anh giao tiếp', hệ thống tự động gợi ý khóa 'Tiếng Anh thương mại' dựa trên hồ sơ nghề nghiệp của họ, kèm theo ưu đãi cho học viên cũ.\n- **Automated Nurturing:** Xây dựng chuỗi email tự động trong 30 ngày để cung cấp giá trị (tài liệu học, video tip) cho phụ huynh trước khi mời đăng ký khóa học, xây dựng niềm tin trước khi bán hàng.",
            "### Key Metric\n- **Course Completion Rate:** Tỷ lệ hoàn thành khóa học.\n- **CLV (Customer Lifetime Value):** Tổng giá trị học phí một học viên đóng góp trong suốt quá trình học tập."
          ]
        }
      ]
    },
    {
      "chapter_id": "ch03",
      "chapter_number": 3,
      "chapter_title": "Khung kiến trúc USPA: DNA của Customer Data Platform",
      "sections": [
        {
          "section_id": "ch03-sec01",
          "section_number": "3.1",
          "section_title": "Triết lý thiết kế và Ứng dụng thực tiễn của USPA",
          "summary_video": {
            "title": "Giới thiệu USPA framework cho việc hiện thực Customer Data Platform",
            "youtube_id": "tyASsGaE8jg"
          },
          "keywords": [
            "Identity Resolution",
            "Single Customer View (SCV)",
            "Real-time Segmentation",
            "Predictive Analytics",
            "Hyper-personalization",
            "Omnichannel Activation",
            "Reverse ETL",
            "Event-Driven Architecture"
          ],
          "summary": "USPA không chỉ là một quy trình kỹ thuật, đó là vòng đời hoàn chỉnh của dữ liệu khách hàng. Chương này phân tích sâu 4 trụ cột: Unification (Hợp nhất định danh), Segmentation (Phân khúc động), Personalization (Cá nhân hóa AI), và Activation (Kích hoạt đa kênh).",
          "content": [
            "![uspa_framework](media/uspa_framework.png)",
            "### Giới thiệu: USPA là gì trong kỷ nguyên Data-Driven?\n\nTrong thế giới công nghệ tiếp thị (MarTech), USPA viết tắt của **Unification (Hợp nhất) - Segmentation (Phân khúc) - Personalization (Cá nhân hóa) - Activation (Kích hoạt)**. Đây là khung kiến trúc tiêu chuẩn vàng để biến dữ liệu thô và hỗn độn thành doanh thu thực tế. Một hệ thống CDP mạnh mẽ không phải chỉ là nơi chứa dữ liệu (Data Lake), mà phải là một cỗ máy vận hành trơn tru theo quy trình 4 bước này với độ trễ thấp nhất (Low Latency).",
            "---",
            "### 1. U - UNIFICATION (Hợp nhất dữ liệu và Định danh)\n\n**Bản chất kỹ thuật:**\nĐây là nền móng của ngôi nhà dữ liệu. Trong môi trường doanh nghiệp, dữ liệu khách hàng bị phân mảnh ở khắp nơi: Cookie trên trình duyệt, ID thiết bị (Device ID) trên Mobile App, Email trong CRM, và Số điện thoại tại POS cửa hàng. Thách thức lớn nhất là: Làm sao biết tất cả những mảnh ghép này thuộc về cùng một người?\n\n**Cơ chế hoạt động:**\n- **Data Ingestion (Thu nạp):** Hệ thống thu thập dữ liệu từ đa nguồn (First-party từ web/app, Second-party từ đối tác) thông qua SDK, API hoặc Batch upload.\n- **Cleaning & Standardization:** Làm sạch dữ liệu (ví dụ: chuyển đổi số điện thoại '+84' và '09' về cùng định dạng).\n- **Identity Resolution (Phân giải định danh):** Đây là trái tim của bước Unification. Hệ thống sử dụng:\n  + *Deterministic Matching (Khớp chính xác):* Nối dữ liệu khi có khóa chung duy nhất (Email, SĐT, User ID).\n  + *Probabilistic Matching (Khớp xác suất):* Sử dụng AI để đoán hai hồ sơ là một dựa trên IP, Browser Fingerprint, Vị trí địa lý với độ tin cậy >90%.\n\n**Use Case thực tiễn:**\n*Khách hàng A lướt xem iPhone trên Laptop (ẩn danh) -> Hôm sau dùng Mobile App đăng nhập để mua ốp lưng -> 3 ngày sau ra cửa hàng mua iPhone.* \n-> **Kết quả Unification:** Hệ thống hợp nhất 3 hành động này vào một **Profile 360 độ (Single Customer View)**. Nếu không có bước này, doanh nghiệp sẽ lãng phí tiền quảng cáo chiếc iPhone cho một người đã mua rồi.",
            "---",
            "### 2. S - SEGMENTATION (Phân khúc khách hàng)\n\n**Bản chất kỹ thuật:**\nSau khi có dữ liệu hợp nhất, chúng ta không thể đối xử với 1 triệu khách hàng như nhau. Segmentation là quá trình chia nhỏ tập khách hàng thành các nhóm có đặc điểm chung để phục vụ mục tiêu tiếp thị chính xác.\n\n**Các loại hình phân khúc:**\n- **Rule-based Segmentation (Theo quy tắc):** Phân nhóm dựa trên logic tĩnh. Ví dụ: 'Nam giới, trên 25 tuổi, sống tại Hà Nội'.\n- **Behavioral Segmentation (Theo hành vi):** Phân nhóm dựa trên hành động. Ví dụ: 'Người đã bỏ giỏ hàng trong 24h qua', 'Người truy cập website >5 lần/tuần'.\n- **RFM Segmentation (Recency - Frequency - Monetary):** Phân tích giá trị khách hàng. Nhóm VIP (mua gần đây, mua nhiều lần, chi nhiều tiền) vs. Nhóm sắp rời bỏ (Churn Risk).\n- **Predictive Segmentation (Dự báo bằng AI):** Sử dụng Machine Learning để tạo nhóm 'Khách hàng có khả năng mua cao trong 7 ngày tới' hoặc 'Khách hàng nhạy cảm với giảm giá'.\n\n**Use Case thực tiễn (Ngành E-commerce):**\nDoanh nghiệp muốn chạy chiến dịch xả kho áo khoác mùa đông. Thay vì gửi email cho toàn bộ database (Spam), hệ thống USPA truy vấn Real-time:\n*Query:* 'Tìm tất cả khách hàng nữ, sống ở miền Bắc (nơi đang lạnh), đã từng mua đồ thời trang >500k, nhưng chưa quay lại trong 30 ngày'.\n-> **Kết quả:** Tạo ra một tệp audience chính xác cao, giúp tăng Open Rate và giảm chi phí gửi tin.",
            "---",
            "### 3. P - PERSONALIZATION (Cá nhân hóa trải nghiệm)\n\n**Bản chất kỹ thuật:**\nSegmentation cho chúng ta biết 'Gửi cho ai', còn Personalization trả lời câu hỏi 'Gửi cái gì'. Mục tiêu là đạt được **Hyper-personalization (Cá nhân hóa siêu cấp)** - tức là 'Segment of One' (Mỗi khách hàng là một phân khúc riêng biệt).\n\n**Công nghệ lõi:**\n- **Recommendation Engine:** Sử dụng thuật toán lọc cộng tác (Collaborative Filtering) hoặc lọc theo nội dung (Content-based) để gợi ý sản phẩm. 'Những người mua bỉm thường mua thêm sữa'.\n- **Dynamic Content (Nội dung động):** Thay đổi hiển thị trên Website/App theo thời gian thực. Banner trang chủ sẽ thay đổi dựa trên sở thích của người đang xem.\n- **Generative AI Integration:** Tích hợp LLM để tự động viết tiêu đề email hoặc nội dung chat phù hợp với giọng văn mà khách hàng đó thích (Trang trọng vs. Hài hước).\n\n**Use Case thực tiễn (Ngành Du lịch/OTA):**\nKhi khách hàng B truy cập ứng dụng đặt vé:\n- Nếu B là doanh nhân (dựa trên lịch sử đặt vé phút chót, hạng thương gia): Hiển thị gợi ý khách sạn gần trung tâm hội nghị, có dịch vụ đưa đón sân bay, Wi-Fi mạnh.\n- Nếu B là người đi du lịch gia đình (lịch sử đặt vé trẻ em): Hiển thị combo khách sạn có hồ bơi trẻ em, gần khu vui chơi, tặng kèm vé ăn sáng.\n-> **Kết quả:** Trải nghiệm người dùng (UX) được tối ưu hóa tối đa, dẫn đến tỷ lệ chuyển đổi (Conversion Rate) tăng vọt.",
            "---",
            "### 4. A - ACTIVATION (Kích hoạt và Phân phối)\n\n**Bản chất kỹ thuật:**\nTất cả Insight sẽ vô nghĩa nếu nó nằm im trong hệ thống. Activation là bước 'bấm nút' để đẩy dữ liệu ra các điểm chạm (Touchpoints). Hệ thống cần khả năng kết nối đa kênh (Omnichannel) thông qua API, Webhooks, và các Connectors có sẵn.\n\n**Các kênh kích hoạt chính:**\n- **Advertising (AdTech):** Đồng bộ tệp khách hàng (Audience Sync) lên Facebook Ads, Google Ads để thực hiện Retargeting hoặc Lookalike (tìm người giống khách VIP).\n- **Marketing Automation (MarTech):** Trigger Email qua Mailchimp, gửi tin Zalo ZNS, gửi Push Notification qua Firebase.\n- **Sales & CS (CRM):** Đẩy thông tin 'Khách hàng vừa xem bảng giá' về CRM (Salesforce, HubSpot) để nhân viên Sales gọi điện tư vấn ngay lập tức.\n- **On-site/In-app:** Hiển thị Popup giảm giá, Chatbot tự động chào tên khách hàng.\n\n**Use Case thực tiễn (Ngành Tài chính/Ngân hàng):**\n*Kịch bản:* Khách hàng đang xem trang 'Vay mua nhà' trên website ngân hàng nhưng thoát ra.\n1. **Ngay lập tức (<1s):** Website hiển thị Popup: 'Bạn cần tư vấn lãi suất vay? Chat ngay'.\n2. **Sau 30 phút:** Nếu khách chưa chat, gửi Zalo Message với bảng tính lãi suất vay tham khảo.\n3. **Sau 24h:** Nếu khách vẫn chưa tương tác, đẩy Lead về cho Telesales với ghi chú 'Khách quan tâm vay mua nhà, điểm tín dụng tốt'.\n-> **Kết quả:** Activation đảm bảo không bỏ sót bất kỳ cơ hội bán hàng nào, đồng thời giữ tương tác liền mạch qua mọi kênh.",
            "---",
            "### Tổng kết giá trị của USPA\n\nKhung kiến trúc USPA giúp doanh nghiệp giải quyết 3 bài toán sinh tồn:\n1.  **Hiểu đúng khách hàng (Know your customer):** Nhờ Unification và Segmentation.\n2.  **Đối xử đúng cách (Treat them right):** Nhờ Personalization.\n3.  **Hành động đúng thời điểm (Act in time):** Nhờ Activation.\n\nViệc tuân thủ chặt chẽ quy trình dòng chảy dữ liệu này giúp doanh nghiệp chuyển dịch từ mô hình 'Spray and Pray' (Quảng cáo đại trà và cầu nguyện) sang mô hình 'Data-Driven Precision' (Chính xác dựa trên dữ liệu), tối ưu hóa từng đồng chi phí Marketing (ROAS) và tối đa hóa giá trị vòng đời khách hàng (LTV)."
          ]
        }
      ]
    },
    {
      "chapter_id": "ch04",
      "chapter_number": 4,
      "chapter_title": "Unification: Thống nhất dữ liệu (Bộ nhớ)",
      "sections": [
        {
          "section_id": "ch04-sec01",
          "section_number": "4.1",
          "section_title": "Hồ sơ khách hàng hợp nhất (Single Customer View)",
          "keywords": [
            "ID Resolution",
            "Deduplication Algorithms",
            "Graph DB",
            "Data Quality"
          ],
          "summary": "Quy trình kỹ thuật để gộp dữ liệu trùng lặp (Merge) và tạo ra một 'Golden Record' duy nhất cho mỗi khách hàng.",
          "content": [
            "![profile360](media/profile360.png)",
            "<a href=\"https://dcdp.bigdatavietnam.org/#calljs-leoCdpRouter('Customer_Profile_Info','4ll3Hz8KVWQ8eFijFi4YfN')\" target=\"_blank\"><strong>Live Demo – Unified Customer Profile</strong></a>",
            "<strong>Unified Customer Profile (Hồ sơ khách hàng 360°)</strong>: Màn hình tổng hợp toàn bộ thông tin định danh, hành vi và tương tác của khách hàng trên một giao diện duy nhất.",
            "Profile Metadata: Hiển thị đầy đủ vòng đời hồ sơ bao gồm thời điểm tạo, nguồn cập nhật (CDP, CRM) và trạng thái dữ liệu. Data Quality Score được tính toán tự động nhằm đánh giá mức độ đầy đủ và tin cậy của hồ sơ.",
            "Identity Resolution: Hợp nhất các định danh như Email, Phone, Cookie ID, Device ID và dữ liệu từ CRM vào một Customer Profile duy nhất, giúp loại bỏ trùng lặp và đảm bảo một nguồn dữ liệu khách hàng chuẩn (Single Customer View).",
            "Segmentation & Labels: Hồ sơ được gán động vào nhiều phân khúc (Segments) và nhãn dữ liệu (Data Labels) dựa trên hành vi, sự kiện, nguồn dữ liệu và logic kinh doanh, hỗ trợ cá nhân hóa theo thời gian thực.",
            "Data Journey Map: Trực quan hóa hành trình khách hàng xuyên suốt các kênh và chiến dịch. Biểu đồ Top Engaged Touchpoints giúp xác định nội dung, sản phẩm và điểm chạm có mức độ tương tác cao nhất.",
            "Business Value: Giúp đội Marketing, Sales và CS hiểu rõ khách hàng theo ngữ cảnh, tối ưu chiến dịch cá nhân hóa, giảm spam do trùng hồ sơ và nâng cao trải nghiệm khách hàng một cách nhất quán."
          ]
        },
        {
          "section_id": "ch04-sec02",
          "section_number": "4.2",
          "section_title": "Mô hình metric cho dữ liệu sự kiện (Event Data Metrics)",
          "keywords": [
            "JSON Schema",
            "Timeseries Data",
            "Contextual Attributes",
            "Behavioral Analytics"
          ],
          "summary": "Mô hình metrics cho dữ liệu sự kiện (Event Data Metrics) phục vụ phân tích Funnel, chấm điểm hành vi (Scoring) và huấn luyện AI. Đảm bảo tính nhất quán xuyên suốt từ thu thập dữ liệu, phân tích hành trình đến kích hoạt cá nhân hóa.",
          "content": [
            "![event metrics model](media/event_metrics_model.png)",
            "<strong>Event Funnel Model:</strong> Hệ thống ánh xạ từng sự kiện (Event) vào các giai đoạn Funnel chuẩn như New Visitor, Lead, Prospect, Engaged Customer, Happy Customer và Churn, cho phép theo dõi tỷ lệ chuyển đổi và điểm rơi hành vi theo thời gian.",
            "<strong>Event Schema (Tech Spec):</strong> Mỗi sự kiện tuân theo cấu trúc thống nhất: {event_name, event_label, timestamp, profile_id, event_score, loyalty_point, default_funnel_stage, scoring_model, cx_journey_stage, context:{device, channel, ip, location}, payload:{product_id, content_id, price}}.",
            "<strong>Scoring & CX Mapping:</strong> Mỗi Event được gán điểm (Event Score) và liên kết với Scoring Model (Lead Score, Prospect Score, CAC, CSAT…) cũng như CX Journey Stage (Awareness, Attraction, Ask, Action), tạo nền tảng cho phân khúc và automation thông minh.",
            "<strong>Storage Strategy:</strong> Dữ liệu sự kiện được lưu trữ dưới dạng NoSQL (ví dụ: ArangoDB hoặc MongoDB), tối ưu cho khối lượng ghi lớn (write-heavy), truy vấn theo đồ thị hành vi và phân tích chuỗi sự kiện theo thời gian thực.",
            "<strong>Business Insight:</strong> Cho phép trả lời chính xác các câu hỏi trọng yếu như: Khách hàng rơi rớt ở bước nào trong Funnel? Sự kiện nào thúc đẩy chuyển đổi mạnh nhất? Nội dung hoặc sản phẩm nào có mức tương tác cao nhưng tỷ lệ mua thấp?",
            "<strong>AI Readiness:</strong> Event Data là đầu vào trực tiếp cho mô hình dự đoán chuyển đổi, churn prediction, next-best-action và hệ AI Agent vận hành Marketing & Sales Automation."
          ]
        }
      ]
    },
    {
      "chapter_id": "ch05",
      "chapter_number": 5,
      "chapter_title": "Segmentation: Phân khúc khách hàng (Lý luận)",
      "sections": [
        {
          "section_id": "ch05-sec01",
          "section_number": "5.1",
          "section_title": "Phân khúc theo quy tắc (Rule-based Segmentation)",
          "keywords": [
            "Boolean Logic",
            "Visual Query Builder",
            "Real-time Segmentation",
            "Audience Targeting",
            "Retargeting",
            "Explainable Segment"
          ],
          "summary": "Cơ chế phân khúc khách hàng dựa trên tập quy tắc nghiệp vụ có thể giải thích (rule-based), cho phép đội Marketing và Data định nghĩa tập khách hàng mục tiêu bằng giao diện trực quan, hỗ trợ truy vấn real-time và kích hoạt chiến dịch tức thời.",
          "content": [
            "![segment builder](media/segment_builder.png)",
            "<strong>Visual Segment Builder:</strong> Giao diện kéo–thả cho phép xây dựng logic phân khúc bằng các toán tử AND / OR / NOT, hỗ trợ nhóm điều kiện (rule group) và kết hợp dữ liệu hồ sơ, hành vi và Funnel Stage.",
            "<strong>Rule Definition:</strong> Ví dụ: (Data Funnel Stage = 'Engaged Customer') AND (Primary Email IS NOT EMPTY OR Primary Phone IS NOT EMPTY) AND (Behavioral Event Metrics CONTAINS 'Purchase' OR 'Made Payment').",
            "<strong>Real-time Query:</strong> Phân khúc có thể cấu hình chạy real-time nhằm đảm bảo kết quả luôn phản ánh dữ liệu mới nhất khi có event phát sinh (event-triggered recomputation).",
            "<strong>Governance & Access Control:</strong> Hỗ trợ phân quyền người xem và người chỉnh sửa segment, đảm bảo tuân thủ quy trình dữ liệu và kiểm soát truy cập theo vai trò.",
            "<strong>Business Activation:</strong> Segment được sử dụng trực tiếp cho Marketing Automation, cá nhân hóa nội dung, đồng bộ audience sang Facebook / Google / Email system và các nền tảng Digital Marketing khác.",
            "<strong>Explainability & Auditability:</strong> Mỗi hồ sơ trong segment đều có thể truy vết lý do thỏa điều kiện, giúp đội Marketing, Sales và Compliance dễ dàng kiểm tra và giải thích quyết định phân khúc."
          ]
        },
        {
          "section_id": "ch05-sec02",
          "section_number": "5.2",
          "section_title": "Phân khúc nâng cao bằng AI (Predictive)",
          "keywords": [
            "Machine Learning",
            "Churn Prediction",
            "CLTV Modeling",
            "Lookalike Audiences"
          ],
          "summary": "Sử dụng ML để dự đoán tương lai. Tech: Scikit-learn/TensorFlow pipelines. Business: Chiến lược giữ chân chủ động (Proactive Retention).",
          "content": [
            "Tech Models: Sử dụng mô hình RFM (Recency, Frequency, Monetary) kết hợp với Gradient Boosting để chấm điểm khách hàng (Scoring).",
            "Churn Prediction: Hệ thống cảnh báo khách hàng có xác suất rời bỏ > 80% trong tháng tới dựa trên việc giảm tần suất tương tác.",
            "Business Strategy: Tập trung ngân sách vào nhóm có CLTV (Giá trị vòng đời) cao, thay vì rải tiền khuyến mãi cho tất cả mọi người."
          ]
        }
      ]
    },
    {
      "chapter_id": "ch06",
      "chapter_number": 6,
      "chapter_title": "Personalization: Cá nhân hóa (Ra quyết định)",
      "sections": [
        {
          "section_id": "ch06-sec01",
          "section_number": "6.1",
          "section_title": "Recommendation Engine",
          "keywords": [
            "Collaborative Filtering",
            "Content-based Filtering",
            "Matrix Factorization",
            "Upsell/Cross-sell"
          ],
          "summary": "Hệ thống gợi ý thông minh. Tech: Vector Search & Ranking Algorithms. Business: Tăng AOV và CTR.",
          "content": [
            "Tech Detail: Kết hợp Collaborative Filtering (Người giống người) và Content-based (Sản phẩm giống sản phẩm). Xử lý vấn đề 'Cold Start' cho người dùng mới.",
            "API Response: Trả về danh sách JSON sản phẩm gợi ý kèm theo `confidence_score` cho Frontend hiển thị.",
            "Business Impact: Khách hàng thấy đúng thứ họ cần tìm. Tăng tỷ lệ click (CTR) lên 30-50% trên các widget 'Có thể bạn sẽ thích'."
          ]
        },
        {
          "section_id": "ch06-sec02",
          "section_number": "6.2",
          "section_title": "Cá nhân hóa nội dung động",
          "keywords": [
            "Dynamic Content Injection",
            "A/B Testing",
            "Hyper-personalization"
          ],
          "summary": "Thay đổi giao diện Web/App theo thời gian thực. Tech: Server-side rendering (SSR) hoặc Client-side JS SDK. Business: Trải nghiệm 1-1.",
          "content": [
            "Tech Mechanism: LEO JS SDK nhận diện Segment ID của user và thay thế DOM element (Banner, Title) bằng nội dung tương ứng được cấu hình trước.",
            "Testing: Tích hợp A/B Testing tự động để so sánh hiệu quả giữa các biến thể nội dung.",
            "Business Scenario: Khách hàng nam, thích thể thao thấy banner giày chạy bộ. Khách hàng nữ, thích yoga thấy banner thảm tập. Tất cả trên cùng một URL trang chủ."
          ]
        }
      ]
    },
    {
      "chapter_id": "ch07",
      "chapter_number": 7,
      "chapter_title": "Activation: Kích hoạt (Hành động)",
      "sections": [
        {
          "section_id": "ch07-sec01",
          "section_number": "7.1",
          "section_title": "Multi-channel Connectors",
          "keywords": [
            "REST API",
            "Webhook",
            "Server-to-Server",
            "Throttling"
          ],
          "summary": "Cổng giao tiếp với thế giới bên ngoài. Tech: Quản lý API Token, Rate Limiting. Business: Đồng bộ hóa đa kênh.",
          "content": [
            "Tech Implementation: Hỗ trợ Webhook (POST JSON), tích hợp API trực tiếp với Facebook CAPI, Google Analytics 4 (MP), Zalo OA, Email Service (SendGrid/Mailchimp).",
            "Reliability: Cơ chế 'Retry with Exponential Backoff' (Thử lại thông minh) khi API bên thứ 3 bị lỗi, đảm bảo không mất dữ liệu.",
            "Business Reach: Tiếp cận khách hàng ở bất cứ đâu họ hiện diện (Web, App, Social, Email) với cùng một thông điệp nhất quán."
          ]
        },
        {
          "section_id": "ch07-sec02",
          "section_number": "7.2",
          "section_title": "Journey Orchestration",
          "keywords": [
            "Workflow Engine",
            "Trigger-based Marketing",
            "Visual Flow Builder"
          ],
          "summary": "Nhạc trưởng điều phối trải nghiệm. Tech: DAG (Directed Acyclic Graph) execution. Business: Tự động hóa quy trình nuôi dưỡng khách hàng.",
          "content": [
            "Visual Tool: Giao diện kéo thả cho phép Marketer thiết kế luồng: 'Nếu User bỏ giỏ hàng -> Chờ 2 giờ -> Gửi Push App -> Nếu không mở -> Gửi Email sáng hôm sau'.",
            "Tech Logic: Xử lý các điều kiện rẽ nhánh (Decision Nodes) và độ trễ (Delay Nodes) trên quy mô hàng triệu users đồng thời.",
            "Automation: Chuyển từ 'Blast Marketing' (Gửi đồng loạt) sang 'Trigger-based Marketing' (Đúng người, đúng thời điểm, đúng ngữ cảnh)."
          ]
        }
      ]
    },
    {
      "chapter_id": "ch08",
      "chapter_number": 8,
      "chapter_title": "Triển khai LEO CDP (Deployment Architecture)",
      "sections": [
        {
          "section_id": "ch08-sec01",
          "section_number": "8.1",
          "section_title": "Kiến trúc Triển khai LEO CDP – Demo & Production-ready",
          "keywords": [
            "LEO CDP Deployment",
            "Nginx Reverse Proxy",
            "ArangoDB",
            "Keycloak SSO",
            "Microservices Architecture",
            "Event-driven Data Hub",
            "Security & Network Segmentation",
            "Scalable CDP"
          ],
          "summary": "LEO CDP được triển khai theo kiến trúc phân tách rõ ràng giữa Data Hub, Core Database, Application Layer và Identity & Access Management. Mô hình này cho phép hệ thống vừa phục vụ demo, vừa sẵn sàng mở rộng lên production với khả năng chịu tải cao, bảo mật tốt và dễ vận hành.",
          "content": [
            "![leo cdp deployment](media/leo_cdp_deployment.png)",
            "<a href=\"https://dcdp.bigdatavietnam.org\" target=\"_blank\"><center><h2>Live Demo</h2></center></a>",
            "### 1. Tổng quan kiến trúc triển khai\n\nLEO CDP được thiết kế theo mô hình **distributed system**, trong đó mỗi thành phần có vai trò rõ ràng và giao tiếp với nhau qua network nội bộ được kiểm soát.\n\nMục tiêu kiến trúc:\n- Tách ingestion, processing và presentation\n- Dễ scale từng thành phần độc lập\n- Giảm rủi ro bảo mật bằng network segmentation",
            "### 2. Data Sources & Ingestion Layer\n\n**Nguồn dữ liệu bên ngoài** bao gồm:\n- Website, Mobile App\n- Google, Facebook Page, Zalo OA\n- CRM, hệ thống nội bộ doanh nghiệp\n\nTất cả dữ liệu đều đi qua **Data Hub API**, không kết nối trực tiếp vào database.\n\nĐiều này giúp:\n- Chuẩn hóa event\n- Kiểm soát schema\n- Dễ audit và debug",
            "### 3. Data Hub API – Cổng vào duy nhất của dữ liệu\n\n**Data Hub API** chạy trên:\n- IP: `192.168.0.2`\n- DNS: `datahub4dcdp.bigdatavietnam.org`\n- TCP Port: `9083`\n\nVai trò:\n- Nhận behavioral & transactional events\n- Đồng bộ dữ liệu từ CRM\n- Đẩy event vào Core Database\n\nData Hub **không xử lý business logic**, chỉ làm ingestion & routing.",
            "### 4. Nginx Proxy & Load Balancer\n\nNginx đóng vai trò **Reverse Proxy + Load Balancer** tại:\n- IP: `192.168.1.3`\n- DNS: `datahub4dcdp.bigdatavietnam.org`\n\nChức năng:\n- Route request từ Internet vào đúng service\n- Cân bằng tải khi mở rộng nhiều instance\n- Che giấu topology nội bộ\n\nĐây là lớp bảo vệ đầu tiên trước Internet.",
            "### 5. Core Database – ArangoDB\n\n**ArangoDB** là Core Database của LEO CDP:\n- IP: `192.168.1.4`\n- TCP Port: `8600`\n\nVai trò:\n- Lưu Customer Profile\n- Identity Graph (Profile – Device – Event)\n- Journey Map, Segment, Campaign, Agent Config\n\nArangoDB cho phép CDP:\n- Truy vấn quan hệ phức tạp\n- Phân tích hành vi theo ngữ cảnh\n- Phục vụ AI Agents theo thời gian thực",
            "### 6. Application Layer – Admin & Chatbot CDP\n\nLEO CDP có hai ứng dụng chính:\n\n**Admin CDP**\n- DNS: `dcdp.bigdatavietnam.org`\n- TCP Port: `9072`\n- Dành cho admin & business users\n\n**Chatbot CDP / AI Assistant**\n- DNS: `leobot.leocdp.com`\n- TCP Port: `8888`\n- Giao tiếp trực tiếp với end-users\n\nCả hai đều truy cập dữ liệu thông qua Core Database, không bypass Data Hub.",
            "### 7. Identity & Access Management – Single Sign-On\n\nLEO CDP sử dụng **Keycloak** cho SSO:\n- Quản lý user, role, permission\n- Phân quyền Admin / Business / System\n\nLợi ích:\n- Không hard-code auth\n- Dễ tích hợp enterprise IAM\n- Phù hợp triển khai đa tenant",
            "### 8. Backup & Data Safety\n\nDữ liệu được sao lưu định kỳ lên **Cloud Backup Folder**:\n- Không phụ thuộc vào runtime\n- Có thể restore từng collection\n\nĐây là yêu cầu bắt buộc cho production CDP.",
            "### 9. Load Testing & Deployment Workflow\n\n- **Load Test:** Grafana K6 mô phỏng người dùng thật\n- **Source Code:** `leo-cdp-framework`\n- **Deployment Repo:** `leo-cdp-deployment`\n\nCI/CD cho phép:\n- Deploy nhanh demo\n- Mở rộng lên staging / production\n- Kiểm soát version & rollback",
            "### 10. Tư duy triển khai của LEO CDP\n\nLEO CDP không được xây như một \"web app\".\n\nNó được xây như:\n- Một **data system sống**\n- Một **nền tảng cho AI Agents**\n- Một **hệ thống activation dài hạn**\n\nTriển khai đúng kiến trúc là điều kiện tiên quyết để AI Agents hoạt động ổn định, an toàn và có thể mở rộng."
          ]
        }
      ]
    },
    {
      "chapter_id": "ch09",
      "chapter_number": 9,
      "chapter_title": "Tổng kết và Tương lai",
      "sections": [
        {
          "section_id": "ch09-sec01",
          "section_number": "9.1",
          "section_title": "Tương lai của LEO AI Agents",
          "keywords": [
            "Generative AI",
            "RAG Architecture",
            "Privacy Sandbox",
            "Cookie-less Future"
          ],
          "summary": "Định hướng Roadmap 2026+. Tech: GenAI Integration. Business: Tiếp thị tự hành (Autonomous Marketing).",
          "content": [
            "![leo-activation-framework](https://raw.githubusercontent.com/trieu/leo-activation/main/leo-activation-framework.png)",
            "AI-native CDP: Tích hợp LLMs (Large Language Models) để query dữ liệu bằng ngôn ngữ tự nhiên (Natural Language Querying) thay vì SQL.",
            "Privacy First: Chuẩn bị cho kỷ nguyên không Cookie (Cookie-less) với Server-side tracking và Data Clean Rooms.",
            "Vision: Chuyển dịch từ hệ thống hỗ trợ ra quyết định sang hệ thống tự động ra quyết định và thực thi (Fully Autonomous Agents) dưới sự giám sát của con người."
          ]
        }
      ]
    }
  ]
}